{"data": 
[
{"pregunta":"¿Cuáles son los elementos que componen la arquitectura de von Neumann?",
"respuestas": ["a) Unidad de procesamiento, memoria y mecanismos de entrada/salida de información (entre los que podemos resaltar almacenamiento masivo externo).", 
               "b) Unidad de procesamiento, GPU y periféricos.", 
               "c) Tarjeta madre, memoria y periféricos.", 
               "d) CPU, RAM y disco duro."],
"opc_correcta": 0},
{"pregunta":"¿Los siguientes dispositivos cumplen con la arquitectura de von Neumann?",
"respuestas": ["a) Un smartphone.", 
               "b) Un monitor.", 
               "c) Una teclado.", 
               "d) Unos altavoces."],
"opc_correcta": 0},
{"pregunta":"¿Cuáles son las principales magnitudes de un microprocesador?",
"respuestas": ["a) Frecuencia, sistema operativo y memoria RAM.", 
               "b) Frecuencia, conjunto de instrucciones, memoria caché y número de núcleos.", 
               "c) Velocidad de conexión, tamaño del disco duro y tipo de puerto.", 
               "d) Voltaje, tamaño físico y marca del fabricante."],
"opc_correcta": 1},
{"pregunta":"¿Puede un procesador disponer de varias unidades aritmético lógicas?",
"respuestas": ["a) Sí.", 
               "b) No.", 
               "c) Depende.", 
               "d) Un procesador nunca tiene ALUs."],
"opc_correcta": 0},
{"pregunta":"¿Cuáles son las dos familias principales de procesadores y cuál es la diferencia fundamental entre ellas?",
"respuestas": ["a) CISC y RISC; la diferencia radica en el color de la carcasa.", 
               "b) AMD e Intel; la diferencia radica en el fabricante.", 
               "c) CISC y RISC; la diferencia radica en la complejidad de las instrucciones.", 
               "d) Intel y ARM; la diferencia radica en el tipo de arquitectura."],
"opc_correcta": 2},
{"pregunta":"¿Cuáles son los componentes básicos que forman la estructura de un procesador?",
"respuestas": ["a) CPU y RAM.", 
               "b) Unidad de Control y Unidad de Proceso.", 
               "c) Tarjeta madre y tarjeta de vídeo.", 
               "d) Sistema operativo y BIOS."],
"opc_correcta": 1}
]
}